{
	"setnumber": 1,
	"scene": [
		{
			"id": 0,
			"dialogs": [
				{
					"char": "Merchant",
					"type": "line",
					"line": "Ah, a traveler! You’ve left the old town behind, haven’t you? A place like that rarely embraces those who dare to be different."
				},
				{
					"char": "Knight",
					"type": "line",
					"line": "They’re wary of change, but don’t let that discourage you. Sometimes, what we leave behind isn’t worth chasing after."
				},
				{
					"char": "Merchant",
					"type": "line",
					"line": "Or perhaps you should return... as a hero! This fine armor will make you unstoppable, proof of your worth to them!"
				},
				{
					"char": "Knight",
					"type": "line",
					"line": "Unstoppable, but isolated. True acceptance doesn’t come from walls of steel. It comes from letting others see your true self."
				},
				{
					"char": "Merchant",
					"type": "line",
					"line": "Without protection, you’ll be vulnerable to harm, failure, rejection. This armor can shield you from it all. Isn’t that what you need?"
				},
				{
					"char": "Knight",
					"type": "line",
					"line": "And what good is protection if you can’t move forward? That armor might protect you, but it will slow you down, keeping you from reaching new places or people."
				},
				{
					"char": "Merchant",
					"type": "question",
					"question": "So, traveler, what will it be? Will you take the armor and stand protected, or face the world bare, trusting in your openness to forge new bonds?",
					"nbanswers": 2,
					"answer0": "I’ll take the armor for the protection it offers.",
					"nextscene0": 1,
					"answer1": "I’ll go without the armor and trust in others.",
					"nextscene1": 2
				}
			]
		},
		{
			"id": 1,
			"dialogs": [
				{
					"char": "Merchant",
					"type": "line",
					"line": "A wise choice, friend. May this armor protect you well in the trials to come!"
				},
				{
					"char": "Merchant",
					"type": "function",
					"function": "IncreaseArmor"
				},
				{
					"char": "Knight",
					"type": "line",
					"line": "I only hope that your armor doesn’t keep others at a distance. True strength isn’t always found behind steel."
				},
				{
					"type": "end",
					"nextscene": "3. Village"
				}
			]
		},
		{
			"id": 2,
			"dialogs": [
				{
					"char": "Merchant",
					"type": "line",
					"line": "A bold decision. I hope your allies are as reliable as you believe. Without armor, you’ll move swiftly, but you’ll need to rely on others for support."
				},
				{
					"char": "Knight",
					"type": "line",
					"line": "Thank you. I believe that through trust and connection, you will find the strength to face whatever awaits."
				},
				{
					"type": "end",
					"nextscene": "3. Village"
				}
			]
		}
	]
}
