{
	"scene": [
		{
			"id": 0,
			"dialogs": [
				{
					"char": "Merchant",
					"type": "line",
					"line": "This armor is fine-crafted, worthy of any warrior. It will shield you from harm, friend."
				},
				{
					"char": "Knight",
					"type": "line",
					"line": "Hold on, friend. Is armor truly what you need? Protecting yourself may seem wise, but there’s strength in vulnerability as well."
				},
				{
					"char": "Merchant",
					"type": "line",
					"line": "Strength? Vulnerability leaves you exposed. Armor allows you to face your enemies without fear."
				},
				{
					"char": "Knight",
					"type": "line",
					"line": "Perhaps, but walls keep out more than just harm. When you shield yourself, you distance yourself from those who would support you. To truly thrive, we must let others in."
				},
				{
					"char": "Merchant",
					"type": "line",
					"line": "Yet who would rely on a warrior who falls easily? Protection lets you fight another day, to stand strong beside your allies."
				},
				{
					"char": "Knight",
					"type": "line",
					"line": "But if we always hide behind armor, our allies may never know us, never truly understand our struggles. Connection requires openness, not barriers."
				},
				{
					"char": "Merchant",
					"type": "question",
					"question": "So, what will you do? Will you accept the armor for protection or trust in your strength and openness with others?",
					"nbanswers": 2,
					"answer0": "I’ll take the armor. Safety is worth it.",
					"nextscene0": 1,
					"answer1": "I’ll go without. My strength lies in my trust in others.",
					"nextscene1": 2
				}
			]
		},
		{
			"id": 1,
			"dialogs": [
				{
					"char": "Merchant",
					"type": "line",
					"line": "A wise choice, friend. May this armor protect you well in the trials to come."
				},
				{
					"char": "Knight",
					"type": "line",
					"line": "I only hope that your armor doesn’t keep others at a distance. True strength isn’t always found behind steel."
				},
				{
					"type": "end"
				}
			]
		},
		{
			"id": 2,
			"dialogs": [
				{
					"char": "Merchant",
					"type": "line",
					"line": "A bold decision. I hope your allies are as reliable as you believe."
				},
				{
					"char": "Knight",
					"type": "line",
					"line": "Thank you, Merchant. I believe that through trust and connection, I will find the strength to face whatever awaits."
				},
				{
					"type": "end"
				}
			]
		}
	]
}
