{
	"setnumber": 1,
	"scene": [
		{
			"id": 0,
			"dialogs": [
				{
					"char": "Merchant",
					"type": "line",
					"line": "Ah, a traveler! You look like you’ve seen better days. That town back there isn’t always kind to those who walk a different path."
				},
				{
					"char": "Knight",
					"type": "line",
					"line": "They’re wary of change, but don’t let that discourage you. New beginnings often lie beyond the hardest doors."
				},
				{
					"char": "Merchant",
					"type": "line",
					"line": "Speaking of new beginnings, let me offer you something. This armor is fine-crafted, and worthy of any warrior. It will shield you from harm, brave traveler."
				},
				{
					"char": "Knight",
					"type": "line",
					"line": "Hold on, friend. Is armor truly what you need? Protecting yourself may seem wise, but there’s strength in vulnerability as well."
				},
				{
					"char": "Merchant",
					"type": "line",
					"line": "Strength? Vulnerability leaves you exposed. Armor allows you to face your enemies without fear. Though, I won’t lie... it does come at a cost."
				},
				{
					"char": "Knight",
					"type": "line",
					"line": "A cost? Indeed. Heavy armor will weigh you down, limiting your agility. You’ll feel its burden with every step, and perhaps find yourself slower to act in a moment of need."
				},
				{
					"char": "Merchant",
					"type": "line",
					"line": "True, but its protection is unmatched. Damage that would end a lesser warrior will glance off harmlessly. You’ll stand longer in battle, even if your movements are slower."
				},
				{
					"char": "Knight",
					"type": "line",
					"line": "But walls keep out more than just harm. When you shield yourself, you distance yourself from those who would support you. To truly thrive, we must let others in."
				},
				{
					"char": "Merchant",
					"type": "line",
					"line": "Yet who would rely on a warrior who falls easily? Protection lets you fight another day, to stand strong beside your allies."
				},
				{
					"char": "Knight",
					"type": "line",
					"line": "But if we always hide behind armor, our allies may never know us, never truly understand our struggles. Connection requires openness, not barriers."
				},
				{
					"char": "Merchant",
					"type": "question",
					"question": "So, what will you do? Will you accept the armor for protection and endure its \"weight\", or foolishly trust in your openness with others and expose yourself vulnerability?",
					"nbanswers": 2,
					"answer0": "I’ll take the armor for the added protection, even at the cost of agility.",
					"nextscene0": 1,
					"answer1": "I’ll go without the protection and in trust in others.",
					"nextscene1": 2
				}
			]
		},
		{
			"id": 1,
			"dialogs": [
				{
					"char": "Merchant",
					"type": "line",
					"line": "A wise choice, friend. May this armor protect you well in the trials to come. But remember... its weight is a burden you must carry."
				},
				{
					"char": "Merchant",
					"type": "function",
					"function": "IncreaseArmor"
				},
				{
					"char": "Knight",
					"type": "line",
					"line": "I only hope that your armor doesn’t keep others at a distance. True strength isn’t always found behind steel."
				},
				{
					"type": "end",
					"nextscene": "3. Village"
				}
			]
		},
		{
			"id": 2,
			"dialogs": [
				{
					"char": "Merchant",
					"type": "line",
					"line": "A bold decision. I hope your allies are as reliable as you believe. Without armor, you’ll move swiftly, but you’ll need to rely on others for support."
				},
				{
					"char": "Knight",
					"type": "line",
					"line": "Thank you. I believe that through trust and connection, you will find the strength to face whatever awaits."
				},
				{
					"type": "end",
					"nextscene": "3. Village"
				}
			]
		}
	]
}
