{
	"setnumber": 2,
	"scene": [
		{
			"id": 0,
			"dialogs": [
				{
					"char": "Knight",
					"type": "line",
					"line": "Ah, a traveler! My companion, the other knight, spoke of you. I see you’ve chosen to journey without armor. They hold great respect for your resolve."
				},
				{
					"char": "Knight",
					"type": "line",
					"line": "It is no easy path, yet it speaks of your faith in both your allies and your own swiftness."
				},
				{
					"char": "Merchant",
					"type": "line",
					"line": "Hmph. Faith and agility won’t stop an arrow from finding its mark. There is still much to fear."
				},
				{
					"char": "Knight",
					"type": "line",
					"line": "Pay no heed to his warnings. Your choice is a noble one. Together, we shall face the perils ahead with unity and strength."
				},
				{
					"char": "Merchant",
					"type": "line",
					"line": "Yet where will you go after this? How will you become a hero for your people without the protection of armor?"
				},
				{
					"char": "Knight",
					"type": "question",
					"question": "So, friend, what will you do now? Will you take the armor, or strive to find a new path with your allies?",
					"nbanswers": 2,
					"answer0": "I’ll take the armor to become a hero, even if it reduces agility.",
					"nextscene0": 1,
					"answer1": "I’ll go without. My new allies are protection enough.",
					"nextscene1": 2
				}
			]
		},
		{
			"id": 1,
			"dialogs": [
				{
					"char": "Merchant",
					"type": "line",
					"line": "A wise decision. At least now you’ll have some defense in the treacherous forest ahead."
				},
				{
					"char": "Merchant",
					"type": "function",
					"function": "IncreaseArmor"
				},
				{
					"char": "Knight",
					"type": "line",
					"line": "If this is your path, walk it boldly. But remember, no armor can replace the strength found in the bonds of community."
				},
				{
					"type": "end"
				}
			]
		},
		{
			"id": 2,
			"dialogs": [
				{
					"char": "Knight",
					"type": "line",
					"line": "A fine choice! By placing trust in others, you’ve embraced a path that leads to connection and shared strength!"
				},
				{
					"char": "Merchant",
					"type": "line",
					"line": "Hmph. Bold, but risky. Just remember, no one can protect you better than you can protect yourself."
				},
				{
					"type": "end"
				}
			]
		},
		{
			"id": 3,
			"dialogs": [
				{
					"char": "Knight",
					"type": "line",
					"line": "So, you chose to don the armor. My companion hoped you’d lean more upon us, but the choice is yours to make."
				},
				{
   					"char": "Merchant",
    				"type": "line",
   					"line": "Bah! Trust may comfort the soul, but steel keeps you breathing. And judging by your wounds, you need a lot more of it!"
				},
				{
					"char": "Knight",
					"type": "line",
					"line": "Are you certain this is the protection you seek? Remember, weight can hinder as much as it guards."
				},
				{
					"char": "Merchant",
					"type": "line",
					"line": "But you want to become a hero for your people, don’t you? You can’t do that without armor!"
				},
				{
					"char": "Knight",
					"type": "line",
					"line": "Perhaps the path forward is not forged by steel, but by finding allies who accept and strengthen you as you are."
				},
				{
					"char": "Merchant",
					"type": "question",
					"question": "What will you do now? Will you strengthen your armor further, shed some of it to trust in others, or maintain balance?",
					"nbanswers": 3,
					"answer0": "I’ll take more armor protection outweighs cost of agility.",
					"nextscene0": 4,
					"answer1": "I’ll shed some armor. I want to trust in new allies.",
					"nextscene1": 5,
					"answer2": "I’ll keep what I have. A balanced choice feels right.",
					"nextscene2": 6
				}
			]
		},
		{
			"id": 4,
			"dialogs": [
				{
					"char": "Merchant",
					"type": "line",
					"line": "Ah, an even wiser choice! Extra armor will serve you well! You will soon be a hero for your people!"
				},
				{
					"char": "Merchant",
					"type": "function",
					"function": "IncreaseArmor"
				},
				{
					"char": "Knight",
					"type": "line",
					"line": "If this is what your heart tells you, I shall not dissuade you. But remember... true strength lies in the spirit, not just the steel."
				},
				{
					"type": "end"
				}
			]
		},
		{
			"id": 5,
			"dialogs": [
				{
					"char": "Knight",
					"type": "line",
					"line": "Ah, you’ve chosen to lighten your burden. My companion will be glad to hear it!"
				},
				{
					"char": "Knight",
					"type": "line",
					"line": "Together, we will face any challenge as steadfast comrades."
				},
				{
					"char": "Merchant",
					"type": "function",
					"function": "DecreaseArmor"
				},
				{
					"char": "Merchant",
					"type": "line",
					"line": "Hmph. So be it. Just don’t look to me when regret catches up."
				},
				{
					"type": "end"
				}
			]
		},
		{
			"id": 6,
			"dialogs": [
				{
					"char": "Merchant",
					"type": "line",
					"line": "Keeping what you have? A fair decision, I suppose."
				},
				{
					"char": "Merchant",
					"type": "line",
					"line": "Just be sure to remain watchful."
				},
				{
					"char": "Knight",
					"type": "line",
					"line": "A measured choice. Stay vigilant, friend. With or without armor, we stand united."
				},
				{
					"type": "end"
				}
			]
		}
	]
}
